endangered_api/app/controllers/comments_controller.rb

SELECT  "species".* FROM "species" WHERE "species"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("species_id") VALUES ($1) RETURNING "id"  [["species_id", 83]]
---
def create
  @specie= Species.find(params[:species_id])
  @comment= @specie.comments.build(comment_params)
  @comment.save