endangered_api/app/controllers/species_controller.rb

SELECT "species".* FROM "species"
---
    def index
        @species= Species.all

SELECT  "species".* FROM "species" WHERE "species"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # @category = Category.find(params[:category_id])
        @specie = Species.find(params[:id])